tests/Fixtures/stripe/charge.succeeded.real.json

{
  "id": "evt_3SWjQ11d2H50O3q41N267h9u",
  "object": "event",
  "api_version": "2025-06-30.basil",
  "created": 1763927878,
  "data": {
    "object": {
      "id": "ch_3SWjQ11d2H50O3q41w5lRvjo",
      "object": "charge",
      "amount": 1111,
      "amount_captured": 1111,
      "amount_refunded": 0,
      "application": null,
      "application_fee": null,
      "application_fee_amount": null,
      "balance_transaction": "txn_3SWjQ11d2H50O3q41jHwuTnT",
      "billing_details": {
        "address": {
          "city": "Aurora",
          "country": "US",
          "line1": "2429 S. Halifax Way",
          "line2": null,
          "postal_code": "80013",
          "state": "CO"
        },
        "email": "ryanmillergm@gmail.com",
        "name": "Ryan Miller",
        "phone": "720-278-9370",
        "tax_id": null
      },
      "calculated_statement_descriptor": "Stripe",
      "captured": true,
      "created": 1763927878,
      "currency": "usd",
      "customer": "cus_TTQ3dmp1Lkzlq2",
      "description": "Subscription creation",
      "destination": null,
      "dispute": null,
      "disputed": false,
      "failure_balance_transaction": null,
      "failure_code": null,
      "failure_message": null,
      "fraud_details": {},
      "livemode": false,
      "metadata": {},
      "on_behalf_of": null,
      "order": null,
      "outcome": {
        "advice_code": null,
        "network_advice_code": null,
        "network_decline_code": null,
        "network_status": "approved_by_network",
        "reason": null,
        "risk_level": "normal",
        "risk_score": 5,
        "seller_message": "Payment complete.",
        "type": "authorized"
      },
      "paid": true,
      "payment_intent": "pi_3SWjQ11d2H50O3q41HnJpFMo",
      "payment_method": "pm_1SWjPz1d2H50O3q487l3XLrc",
      "payment_method_details": {
        "card": {
          "amount_authorized": 1111,
          "authorization_code": "648934",
          "brand": "visa",
          "checks": {
            "address_line1_check": "pass",
            "address_postal_code_check": "pass",
            "cvc_check": "pass"
          },
          "country": "US",
          "exp_month": 10,
          "exp_year": 2029,
          "extended_authorization": {
            "status": "disabled"
          },
          "fingerprint": "RTqEBcbpXEGKMdUw",
          "funding": "credit",
          "incremental_authorization": {
            "status": "unavailable"
          },
          "installments": null,
          "last4": "4242",
          "mandate": null,
          "multicapture": {
            "status": "unavailable"
          },
          "network": "visa",
          "network_token": {
            "used": false
          },
          "network_transaction_id": "828411369669998",
          "overcapture": {
            "maximum_amount_capturable": 1111,
            "status": "unavailable"
          },
          "regulated_status": "unregulated",
          "three_d_secure": null,
          "wallet": null
        },
        "type": "card"
      },
      "radar_options": {},
      "receipt_email": null,
      "receipt_number": null,
      "receipt_url": "https://pay.stripe.com/receipts/invoices/CAcaFwoVYWNjdF8xUm9zZWYxZDJINTBPM3E0KMfOjckGMgaCJ2uWBYA6LBZGKhGfcSaFZLmrX-6O8EgVWUAfLBaMtJD3MGYedGdVkfwRmYAvSjCcBtAz?s=ap",
      "refunded": false,
      "review": null,
      "shipping": null,
      "source": null,
      "source_transfer": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_upoO5eGeW1NSNK",
    "idempotency_key": "013e215a-bbb9-4b97-bcae-fda2385bdb81"
  },
  "type": "charge.succeeded"
}